OdIfc.OdIfcInstance.ownerId
\details
Retrieves the identifier of the instance object's parent item.
\returns A raw pointer to a stub object that provides access to the database.
\remarks
The method returns a NULL pointer if the instance object doesn't have parent item.

OdIfc.OdIfcInstance.subWorldDraw(OdGiWorldDraw*)
\details
Draws a graphical instance representation that is independent of any viewport context.
\param wd [in] A raw pointer to the object that encapsulates parameters of viewport-independent vectorization.
\returns true if the drawing was successful; otherwise, the method returns false.

OdIfc.OdIfcInstance.subSetAttributes(OdGiDrawableTraits*)
\details
Sets the values of the instance's sub-entity traits.
\param traits [out] A raw pointer to the traits to be filled and returned to a calling subroutine.
\returns The result of setting the values.

OdIfc.OdIfcInstance.gsNode
\details
Retrieves the current Gs node object of the instance.
\returns A raw pointer to the OdGsCache object associated with the instance.

OdIfc.OdIfcInstance.setGsNode(OdGsCache*)
\details
Sets a new Gs node cache for the instance.
\param pGsNode [in] A raw pointer to an OdGsCache object.

OdIfc.OdIfcInstance.unresolve
\details
Unresolves the instance.

OdIfc.OdIfcInstance.resolve(OdIfc.IfcOpResult,System.Void*)
\details
Resolves the instance and returns the result of the instance composition to a calling subroutine.
\param resolved [in]  A resolution operation result.
\param resPtr   [out] A raw pointer that references the instance composition result value.

OdIfc.OdIfcInstance.putAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new value of an attribute that is specified by its name.
\param explicitAttrName [in] An ANSI string that contains the attribute name.
\param val              [in] A new attribute value to be set.
\returns true if the attribute value was successfully set; otherwise, the method returns false.

OdIfc.OdIfcInstance.unsetAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Clears the attribute value.
\param explicitAttrName [in] An ANSI string that contains the attribute name.

OdIfc.OdIfcInstance.testAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the attribute value is set or is unset.
\returns true if the attribute has a value; otherwise, the method returns false (the attribute value is not set).
\details
Retrieves whether the attribute value is set or is unset.
\param explicitAttrName [in] An ANSI string that contains the attribute name.
\returns true if the attribute has a value; otherwise, the method returns false (the attribute value is not set).

OdIfc.OdIfcInstance.isKindOf(OdIfc.OdIfcEntityType)
\details
Retrieves whether the instance belongs to a specified entity type.
\param entityType [in] An entity type.
\returns true if the entity belongs to the specified type; otherwise, the method returns false.

OdIfc.OdIfcInstance.Dispose
\details
Destroys the instance object.
\remarks
All attached compound objects are deleted as well.

OdIfc.OdIfcInstance.#ctor
\details
Creates a new IFC instance object with default parameters.

OdIfc.OdIfcInstance
\details
A class that represents an entity instance of an IFC file and provides IFC-specific functionality.